---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeInsulation
source: html/b1abf676-85e4-268f-d3c9-6c6288c074d4.htm
---
# Autodesk.Revit.DB.Plumbing.PipeInsulation

Represents insulation applied to the outside of a given pipe, fitting or content.

## Syntax (C#)
```csharp
public class PipeInsulation : InsulationLiningBase
```